---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.CannotRemoveLastDisplacedElement
source: html/d78b3658-07b1-98ed-1687-dfb3c28291a3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.CannotRemoveLastDisplacedElement Property

A Displacement Set can only be pasted into a view in the same document in which it was created.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRemoveLastDisplacedElement { get; }
```